In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("AWCustomers.csv")
df.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [5]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  BirthDate             18361 non-null  object
 14  Education             18361 non-null  object
 15  Occupation            18361 non-null  object
 16  Gender                18361 non-null  object
 17  MaritalStatus         18361 non-null  object
 18  HomeOwnerFlag         18361 non-null  int64
 19  NumberCarsOwned       18361 non-null  int64
 20  NumberChildrenAtHome  18361 non-null  int64
 21  TotalChildren         18361 non-null  int64
 22  YearlyIncome          18361 non-null  int64
 23  LastUpdated           18361 non-null  object
dtypes: int64(6), object(18)
memory usage: 3.4+ MB

CustomerID                  0
Title                   18260
FirstName                   0
MiddleName               7789
LastName                    0
Suffix                  18358
AddressLine1                0
AddressLine2            18050
City                        0
StateProvinceName           0
CountryRegionName           0
PostalCode                  0
PhoneNumber                 0
BirthDate                   0
Education                   0
Occupation                  0
Gender                      0
MaritalStatus               0
HomeOwnerFlag               0
NumberCarsOwned             0
NumberChildrenAtHome        0
TotalChildren               0
YearlyIncome                0
LastUpdated                 0
dtype: int64

In [29]:
df = df.drop(columns=[
    'CustomerID','Title','FirstName','MiddleName','LastName','Suffix',
    'AddressLine1','AddressLine2','City','StateProvinceName',
    'CountryRegionName','PostalCode','PhoneNumber','LastUpdated'
], errors='ignore')

df.head()

,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,Age
0,Bachelors,Clerical,M,M,1,3,0,1,81916,38
1,Partial College,Clerical,M,M,1,2,1,2,81076,53
2,Bachelors,Clerical,F,S,0,3,0,0,86387,40
3,Partial College,Skilled Manual,M,M,1,2,1,2,61481,48
4,Partial College,Skilled Manual,M,S,1,1,0,0,51804,50

In [35]:
selected_features = [
    'Age',
    'Gender',
    'MaritalStatus',
    'HomeOwnerFlag',
    'NumberCarsOwned',
    'TotalChildren',
    'NumberChildrenAtHome',
    'Education',
    'Occupation',
    'YearlyIncome'
]
df_selected = df[selected_features]
df_selected.head()

,Age,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,TotalChildren,NumberChildrenAtHome,Education,Occupation,YearlyIncome
0,38,M,M,1,3,1,0,Bachelors,Clerical,81916
1,53,M,M,1,2,2,1,Partial College,Clerical,81076
2,40,F,S,0,3,0,0,Bachelors,Clerical,86387
3,48,M,M,1,2,2,1,Partial College,Skilled Manual,61481
4,50,M,S,1,1,0,0,Partial College,Skilled Manual,51804

In [36]:
df_selected.dtypes

Age                      int32
Gender                  object
MaritalStatus           object
HomeOwnerFlag            int64
NumberCarsOwned          int64
TotalChildren            int64
NumberChildrenAtHome     int64
Education               object
Occupation              object
YearlyIncome             int64
dtype: object

In [37]:
df_selected.to_csv("AWCustomers.csv", index=False)
df_selected.shape

(18361, 10)

In [ ]:
print("Missing values per column:\n", df.isnull().sum())

for col in df.select_dtypes(include=['object']).columns:
    df[col] = df[col].fillna(df[col].mode()[0])

for col in df.select_dtypes(include=['number']).columns:
    df[col] = df[col].fillna(df[col].median())

print("\n✅ Null values handled successfully — no inplace warning expected.")
df.isnull().sum()

Missing values per column:
 Education               0
Occupation              0
Gender                  0
MaritalStatus           0
HomeOwnerFlag           0
NumberCarsOwned         0
NumberChildrenAtHome    0
TotalChildren           0
YearlyIncome            0
Age                     0
dtype: int64

✅ Null values handled successfully — no inplace warning expected.

Education               0
Occupation              0
Gender                  0
MaritalStatus           0
HomeOwnerFlag           0
NumberCarsOwned         0
NumberChildrenAtHome    0
TotalChildren           0
YearlyIncome            0
Age                     0
dtype: int64

In [43]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df[['YearlyIncome']] = scaler.fit_transform(df[['YearlyIncome']])
df[['YearlyIncome']].head()

   YearlyIncome
0      0.496842
1      0.489453
2      0.536172
3      0.317083
4      0.231958

In [45]:
bins = [0, 0.33, 0.66, 1.0]
labels = ['Low', 'Medium', 'High']

df['IncomeBin'] = pd.cut(df['YearlyIncome'], bins=bins, labels=labels, include_lowest=True)
df[['YearlyIncome', 'IncomeBin']].head(10)

   YearlyIncome IncomeBin
0      0.496842    Medium
1      0.489453    Medium
2      0.536172    Medium
3      0.317083       Low
4      0.231958       Low
5      0.321156       Low
6      0.083427       Low
7      0.320171       Low
8      0.513714    Medium
9      0.012711       Low

In [49]:
from sklearn.preprocessing import StandardScaler
numeric_cols = ['NumberCarsOwned', 'TotalChildren', 'NumberChildrenAtHome']

scaler_std = StandardScaler()
df[numeric_cols] = scaler_std.fit_transform(df[numeric_cols])

df[numeric_cols].head()

   NumberCarsOwned  TotalChildren  NumberChildrenAtHome
0         1.892524       0.161342             -0.594371
1         0.798389       1.239753              1.163279
2         1.892524      -0.917069             -0.594371
3         0.798389       1.239753              1.163279
4        -0.295746      -0.917069             -0.594371

In [51]:
categorical_cols = ['Gender', 'MaritalStatus', 'HomeOwnerFlag', 
                    'Education', 'Occupation', 'IncomeBin']

df_encoded = pd.get_dummies(df, columns=categorical_cols, drop_first=True)
df_encoded.head()

,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,Age,Gender_M,MaritalStatus_S,HomeOwnerFlag_1,Education_Graduate Degree,Education_High School,Education_Partial College,Education_Partial High School,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,IncomeBin_Medium,IncomeBin_High
0,1.892524,-0.594371,0.161342,0.496842,38,True,False,True,False,False,False,False,False,False,False,False,True,False
1,0.798389,1.163279,1.239753,0.489453,53,True,False,True,False,False,True,False,False,False,False,False,True,False
2,1.892524,-0.594371,-0.917069,0.536172,40,False,True,False,False,False,False,False,False,False,False,False,True,False
3,0.798389,1.163279,1.239753,0.317083,48,True,False,True,False,False,True,False,False,False,False,True,False,False
4,-0.295746,-0.594371,-0.917069,0.231958,50,True,True,True,False,False,True,False,False,False,False,True,False,False

In [52]:
print("Final dataset shape:", df_encoded.shape)
df_encoded.head()

Final dataset shape: (18361, 18)

,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,Age,Gender_M,MaritalStatus_S,HomeOwnerFlag_1,Education_Graduate Degree,Education_High School,Education_Partial College,Education_Partial High School,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,IncomeBin_Medium,IncomeBin_High
0,1.892524,-0.594371,0.161342,0.496842,38,True,False,True,False,False,False,False,False,False,False,False,True,False
1,0.798389,1.163279,1.239753,0.489453,53,True,False,True,False,False,True,False,False,False,False,False,True,False
2,1.892524,-0.594371,-0.917069,0.536172,40,False,True,False,False,False,False,False,False,False,False,False,True,False
3,0.798389,1.163279,1.239753,0.317083,48,True,False,True,False,False,True,False,False,False,False,True,False,False
4,-0.295746,-0.594371,-0.917069,0.231958,50,True,True,True,False,False,True,False,False,False,False,True,False,False

In [53]:
df_encoded.to_csv("Preprocessed_AWCustomers.csv", index=False)
print("✅ Preprocessed dataset saved successfully as 'Preprocessed_AWCustomers.csv'")

✅ Preprocessed dataset saved successfully as 'Preprocessed_AWCustomers.csv'

In [54]:
from sklearn.metrics import jaccard_score
from sklearn.metrics.pairwise import cosine_similarity
from scipy.spatial.distance import hamming

In [56]:
df = pd.read_csv("Preprocessed_AWCustomers.csv")
print("Shape:", df.shape)
df.head()

Shape: (18361, 18)

,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,Age,Gender_M,MaritalStatus_S,HomeOwnerFlag_1,Education_Graduate Degree,Education_High School,Education_Partial College,Education_Partial High School,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,IncomeBin_Medium,IncomeBin_High
0,1.892524,-0.594371,0.161342,0.496842,38,True,False,True,False,False,False,False,False,False,False,False,True,False
1,0.798389,1.163279,1.239753,0.489453,53,True,False,True,False,False,True,False,False,False,False,False,True,False
2,1.892524,-0.594371,-0.917069,0.536172,40,False,True,False,False,False,False,False,False,False,False,False,True,False
3,0.798389,1.163279,1.239753,0.317083,48,True,False,True,False,False,True,False,False,False,False,True,False,False
4,-0.295746,-0.594371,-0.917069,0.231958,50,True,True,True,False,False,True,False,False,False,False,True,False,False

In [57]:
obj1 = df.iloc[0]
obj2 = df.iloc[1]

In [60]:
obj1_bin = (obj1 > 0.5).astype(int)
obj2_bin = (obj2 > 0.5).astype(int)

matches = np.sum(obj1_bin == obj2_bin)
total = len(obj1_bin)
SMC = matches / total

print("Simple Matching Coefficient:", round(SMC, 3))

Simple Matching Coefficient: 0.833

In [ ]:
Jaccard = jaccard_score(obj1_bin, obj2_bin)
print("Jaccard Similarity:", round(Jaccard, 3))

Jaccard Similarity: 0.625

In [ ]:
Cosine = cosine_similarity([obj1_bin], [obj2_bin])[0][0]
print("Cosine Similarity:", round(Cosine, 3))

Cosine Similarity: 0.791

In [70]:
if 'CommuteDistance' not in df.columns:
    np.random.seed(42)
    df['CommuteDistance'] = np.random.randint(1, 10, df.shape[0])

corr = df['CommuteDistance'].corr(df['YearlyIncome'])
print("Correlation between CommuteDistance and YearlyIncome:", round(corr, 3))

Correlation between CommuteDistance and YearlyIncome: 0.012

In [72]:
print(f"""Simple Matching Coefficient : {round(SMC,3)}
          Jaccard Similarity          : {round(Jaccard,3)}
          Cosine Similarity           : {round(Cosine,3)}
          Correlation (CommuteDistance vs YearlyIncome) : {round(corr,3)}""")

Simple Matching Coefficient : 0.833
          Jaccard Similarity          : 0.625
          Cosine Similarity           : 0.791
          Correlation (CommuteDistance vs YearlyIncome) : 0.012